pr-preview/pr-35/2026.05.26.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[file:2026.05.19.html][先週号]] [[file:index.html][上へ]] [[file:2026.06.02.html][次週号]]

こんにちは

2026年5月19日から26日までの週の OCaml Weekly News をお届けします。

#+TOC: headlines 1


* Dune 3.23
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-dune-3-23/18055/5

** このスレッドを引き継いで、Shon が発表しました


Dune チームは [[https://github.com/ocaml/dune/releases/tag/3.23.1][dune 3.23.1 のリリース]]を喜んでお知らせします。

これは以下のバグ修正からなるパッチリリースです。

このリリースで問題が発生した場合は、[[https://github.com/ocaml/dune/issues][issue tracker]] にご報告ください。

*** 修正内容

- 3.23 で導入された ~menhir~ の opam 依存性注入を修正しました。Dune は既存のユーザー宣言済み ~menhir~ 依存に対して下限 ~{>= "20180523"}~ を設定するのみとなり、自身で宣言していないパッケージに ~menhir~ を新たな依存として追加しなくなりました。(#14434、#14428 を修正、@robinbb)
- 生成された opam ファイルにおける ~dune~ バージョン境界の重複排除（3.23 で導入）を ~(lang dune 3.23)~ に限定するよう変更しました。それ以前の lang バージョンのプロジェクトは従来の ~And [...]~ 形式 — 例: ~{>= "3.17" & >= "3.20"}~ — を維持し、dune バイナリのアップグレード時に opam 出力が意図せず変更される問題を回避して 3.22 の動作を復元します。(#14436、@robinbb)
- 共有 jsoo スタンドアロンランタイムのビルド時にライブラリの順序を保持するようにしました。(#14438、@vouillon)
- セカンダリコンパイラへのフォールバックを修正し、OCaml 4.14 未満の上限を持つパッケージのサポートを回復できるようにしました。dune 3.23.1 以降に依存し、OCaml コンパイラの上限が 4.14 未満のパッケージは最新の dune を使用できるようになりますが、dune はバージョン 4.14 のセカンダリコンパイラでビルドされます。(#14443、@Alizter)
- ~lev_stubs.c~ に ~<sys/wait.h>~ を追加することで NetBSD でのブートストラップを修正しました。既存の FreeBSD/OpenBSD のガードと一致させた変更です。(#14512、#14484 を修正、@0-wiz-0)
      



* 発表募集: ML Family Workshop 2026
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/call-for-presentations-ml-family-workshop-2026/18155/1

** Benoît Montagu が発表しました


*高階、型付き、推論、正格: ML Family Workshop 2026*

*2026年8月28日*

*インディアナポリス（[[https://icfp26.sigplan.org/][ICFP]] と併設）+ パリ（[[https://www.irif.fr/~scherer/events/fpw-2026/announce.html][FW'26]] と併設）*

*ウェブサイト:* https://icfp26.sigplan.org/home/mlfamilyworkshop-2026

*投稿リンク:* https://ml2026.hotcrp.com/

*投稿締切:* 2026年6月24日 AoE

*** 発表募集

ML（元々は「Meta Language」）は Standard ML、OCaml、F# などの方言を含むプログラミング言語のファミリーです。これらの言語の開発は、実践的・理論的の両面で多くのコンピュータサイエンス研究に影響を与えてきました。

ML 2026 ワークショップは 2010 年以来続く非形式的なアプローチを引き継ぎます。発表はプログラム委員会が提出されたプロポーザルから選考します。予稿集は発行されないため、投稿内容は他の場所に発表することが可能です。主な選考基準は、ML ファミリー全体の発展を促進・周知し、活気あるワークショップの雰囲気を生み出すことです。進行中の研究、否定的な結果（期待したが思うように機能しなかったもの）、および根拠に基づく意見の発表を特に奨励します。

各発表は 20〜25 分を予定していますが、スケジュールの制約に応じて決定されます。

*注意*: 今年のワークショップは 2 つのイベントにわたって開催されます。(1) [[https://icfp26.sigplan.org/][ICFP'26]] との併設、および (2) [[https://www.irif.fr/~scherer/events/fpw-2026/announce.html][FW'26]] との併設です。投稿の審査は単一のプログラム委員会が行います。発表者はどちらかのイベントに直接参加することができます。また、リモート参加も奨励しており、リモート発表も対応できるよう計画しています。

*** 対象範囲

以下のトピック（これに限らず）に関する発表を募集します:

- 言語設計: 抽象化、高次多相性、並行・並列処理、分散・移動性、ステージング、半構造化データの拡張、ジェネリックプログラミング、オブジェクトシステムなど
- 実装: コンパイラ、インタプリタ、型検査器、部分評価器、ランタイムシステム、ガーベジコレクタ、外部関数インターフェースなど
- 型システム: 推論、エフェクト、モジュール、コントラクト、仕様とアサーション、動的型付け、エラーレポートなど
- 応用: ケーススタディ、経験報告、パールなど
- 環境: ライブラリ、ツール、エディタ、デバッガ、言語間相互運用性、関数的データ構造など
- ML ファミリー言語の意味論: 操作的・表示的意味論、プログラム等価性、パラメトリシティ、機械化など

期待に応えられなかったこと、あるいはあらゆる努力にもかかわらず満足のいく結果が得られなかったことの報告も特に奨励します。

4 種類の投稿を募集します: 研究発表、経験報告、デモ、根拠に基づく意見。

- 研究発表: 研究発表は、新しいアイデア、実験結果、または ML 関連プロジェクトの重要な進展を説明するものであるべきです。進行中の研究、将来の研究課題の概説、活発な議論を促すような発表を特に奨励します。これらの発表は、少なくとも部分的に（上級）ユーザーにとっても興味深い内容であるべきです。
- 経験報告: ML および関連言語の使用に関する経験報告の投稿を歓迎します。これらの発表は独自の研究を含む必要はありませんが、高度な機能の革新的・予想外の使用方法や、直面している課題・解決しようとしている問題の説明など、研究者や他の上級ユーザーにとって興味深い内容であるべきです。
- デモ: ライブデモンストレーションや短いチュートリアルは、ML および関連言語上に構築された、またはそれらに関連したツール、ライブラリ、アプリケーションの形で、新しい開発、興味深いプロトタイプ、または進行中の作業を示すべきです。（デモに必要なハードウェアおよびソフトウェアはご自身でご用意ください。ワークショップ主催者が提供できるのはプロジェクターのみです。）
- 根拠に基づく意見: 言語機能に対する賛否についての正当化された議論。その議論は、理論的（例: (非)健全性の証明、推論アルゴリズム、計算量解析）、実証的、または相当な経験によって裏付けられている必要があります。個人的な経験も、それが広範で具体的な例によって示されていれば正当化として受け入れられます。

*** 投稿の詳細

投稿は PDF 形式で、冒頭に短い要旨（アブストラクト）を含む必要があります。経験報告、デモ、根拠に基づく意見のカテゴリの投稿は、タイトルまたはサブタイトルでその旨を示してください。投稿の要点は最初の 2 ページから明確に伝わるようにしてください（プログラム委員はそれ以上を読む義務はありません）。

投稿は締切前にワークショップの投稿ウェブサイトにアップロードしてください。

採択された投稿の短い要旨/アブストラクトのみが会議ウェブサイトに掲載されます。採択後、著者は関連資料（更新版の投稿、スライドなど）をその要旨に添付またはリンクする機会があります。

*投稿ウェブサイト*: https://ml2026.hotcrp.com/

*ワークショップウェブサイト*: https://icfp26.sigplan.org/home/mlfamilyworkshop-2026

*** 日程と締切

*投稿締切*: 2026年6月24日（水）AoE

*初回採否通知*（多くの場合）: 2026年7月23日（木）

*最終採否通知*（必要な場合）: 2026年7月30日（木）

*ワークショップ開催日*: 2026年8月28日（金）

*** プログラム委員会

- Benoît Montagu (Inria, フランス)
- Gabriel Scherer (Inria, フランス)
- Sam Westrick (New York University, アメリカ)
- Clément Blaudeau (Inria, フランス)
- Richard A. Eisenberg (Jane Street, アメリカ)
- Kavon Farvardin (Apple, アメリカ)
- Kiran Gopinathan (Basis, アメリカ)
- Magnus Madsen (Aarhus University, デンマーク)
- Alexandre Moine (New York University, アメリカ)
- Dominic Orchard (University of Cambridge; University of Kent, イギリス)
- Lionel Parreaux (HKUST (The Hong Kong University of Science and Technology), 香港 SAR 中国)
- Gabriel Radanne (Inria, フランス)
- Takafumi Saikawa (Nagoya University, 日本)
- Milla Valnet (Sorbonne Université, フランス)
- Michael Vollmer (University of Kent, イギリス)
- Ningning Xie (University of Toronto, カナダ)
- Yizhou Zhang (University of Waterloo, カナダ)

*** 過去の開催

2025: https://conf.researchr.org/home/icfp-splash-2025/mlsymposium-2025

2024: https://icfp24.sigplan.org/home/mlworkshop-2024

2023: https://icfp23.sigplan.org/home/mlworkshop-2023

2022: https://icfp22.sigplan.org/home/mlfamilyworkshop-2022

2021: https://icfp21.sigplan.org/home/mlfamilyworkshop-2021

詳細: https://www.mlworkshop.org/home

*** OCaml Users and Developers Workshop との連携

OCaml ワークショップはより実践的な性格を持ち、OCaml コミュニティの構築と OCaml システムの開発に大きく貢献しています。一方、ML ファミリーワークショップは特定の言語に焦点を当てず、より研究志向であり、ML スタイルのプログラミングと型システムの一般的な問題を扱います。両ワークショップには重複する部分があり、さまざまな形で探求することに前向きです。自身の投稿が両ワークショップに適していると感じる著者は、投稿時にその旨を記載するか、プログラム委員長に連絡することをお勧めします。
      



* ocaml-halo 0.1 -- libuv 上に構築されたパフォーマンス指向の HTTP 1.1 サーバー
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ann-ocaml-halo-0-1-performance-oriented-http-1-1-server-built-on-top-of-libuv/18161/1

** Firgeis が発表しました


こんにちは、コミュニティの皆さん。パフォーマンス指向の OCaml HTTP 1.1 サーバーである [[https://github.com/Firgeis/ocaml-halo][ocaml-halo]] の最初の「アルファ」リリースをお知らせできることを嬉しく思います。

このサーバーの主なアイデアは、HTTP のパフォーマンスに敏感な部分を C で実装し、Effects を活用して FFI の境界と OCaml のリゾルバ間の橋渡しをしやすくすることです。

*** 特徴

- HTTP 1.1 仕様の完全サポート
- SSL/TLS 対応
- ストリーミング
- パフォーマンス：現在 gin-gonic などの Go フレームワークと同等の性能
      



* dead_code_analyzer 1.1.1 および 1.2.0
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-dead-code-analyzer-1-1-1-and-1-2-0/18164/1

** fantazio が発表しました


皆さん、こんにちは。

[[https://github.com/LexiFi/dead_code_analyzer/releases][dead_code_analyzer の 2 つのリリース]]（~opam~ 経由で利用可能）をお知らせします:

- リリース [[https://github.com/LexiFi/dead_code_analyzer/releases/tag/1.1.1][1.1.1]] には多数のバグ修正とセマンティクスの強化が含まれています。また、各レポートセクションの説明、使用方法、例を用いた制限事項を記述した[[https://github.com/LexiFi/dead_code_analyzer/blob/1.1.1/docs/USER_DOC.md][ユーザードキュメント]]も改善されています。このリリースは **OCaml 5.2** と互換性があります。

- リリース [[https://github.com/LexiFi/dead_code_analyzer/releases/tag/1.2.0][1.2.0]] は 1.1.1 のアップデートで、**OCaml 5.3** と互換性があります。アナライザーは入力として ~.cmi~ と ~.cmt~ の代わりに ~.cmti~ と ~.cmt~ ファイルを受け取るようになりました。メモリ消費量が増加する場合があります（詳細は[[https://github.com/LexiFi/dead_code_analyzer/pull/38][こちら]]）。

これらのリリースに加え、**OCaml 4.14** と互換性のあるバージョンが[[https://github.com/fantazio/dead_code_analyzer/tree/4.14][私のフォーク]]で利用可能です。

[[https://ocaml-sf.org/][OCaml Software Foundation]] の資金援助に感謝します！

これらのリリースで問題が発生した場合は、[[https://github.com/LexiFi/dead_code_analyzer/issues][GitHub リポジトリで報告]]してください。
フィードバックと貢献を歓迎します。
      



* 過去の CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

CWN を見逃した場合は、[[mailto:alan.schmitt@polytechnique.org][メッセージを送っていただければ]]メールでお送りします。また、[[https://ocaml.jp/cwn-ja/][アーカイブ]]や[[https://ocaml.jp/cwn-ja/cwn.rss][RSS フィード]]もご覧いただけます。

毎週メールで受け取りたい場合は、[[https://sympa.inria.fr/sympa/info/caml-list][caml-list]] を購読してください。

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
